# Welcome to the Data Manipulation Exercises

The workbook has been broken up into three sections.  Each section correlates to a reading assignment within the textbook.

In [2]:
import pandas as pd
import numpy as np

data= pd.read_csv("C:/Users/Sa Shea/data-analysis-projects-SaSheaG/data-manipulation-exercises-studio/exercises/titanic.csv")

## Before You Get Started

We are going to be using the Titanic Dataset. Make sure to run a head() before you start working with manipulation methods.

In [4]:
# Run the head of your data set here:

data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,849.482500
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,8352.264261
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,928.572250
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,6221.727000
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,943.218500

In [5]:
# check for duplicates
duplicate_rows = data[data.duplicated()]
print("Duplicate rows (all columns): \n", duplicate_rows)

print(data.duplicated().sum())

Duplicate rows (all columns):
      survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
47          1       3  female   NaN      0      0   7.7500        Q   Third
76          0       3    male   NaN      0      0   7.8958        S   Third
77          0       3    male   NaN      0      0   8.0500        S   Third
87          0       3    male   NaN      0      0   8.0500        S   Third
95          0       3    male   NaN      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
870         0       3    male  26.0      0      0   7.8958        S   Third
877         0       3    male  19.0      0      0   7.8958        S   Third
878         0       3    male   NaN      0      0   7.8958        S   Third
884         0       3    male  25.0      0      0   7.0500        S   Third
886         0       2    male  27.0      0      0  13.0000        S  Second

       who  adult_male deck  embark_town alive  alone    fare_2021
47   woman       False  NaN   Queenstown   yes   True   908.067500
76     man        True  NaN  Southampton    no   True   925.150886
77     man        True  NaN  Southampton    no   True   943.218500
87     man        True  NaN  Southampton    no   True   943.218500
95     man        True  NaN  Southampton    no   True   943.218500
..     ...         ...  ...          ...   ...    ...          ...
870    man        True  NaN  Southampton    no   True   925.150886
877    man        True  NaN  Southampton    no   True   925.150886
878    man        True  NaN  Southampton    no   True   925.150886
884    man        True  NaN  Southampton    no   True   826.048500
886    man        True  NaN  Southampton    no   True  1523.210000

[107 rows x 16 columns]
107

In [6]:
# if there are, go ahead and drop them:

data_no_duplicates = data.drop_duplicates()
print(data_no_duplicates)

     survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0           0       3    male  22.0      1      0   7.2500        S  Third
1           1       1  female  38.0      1      0  71.2833        C  First
2           1       3  female  26.0      0      0   7.9250        S  Third
3           1       1  female  35.0      1      0  53.1000        S  First
4           0       3    male  35.0      0      0   8.0500        S  Third
..        ...     ...     ...   ...    ...    ...      ...      ...    ...
885         0       3  female  39.0      0      5  29.1250        Q  Third
887         1       1  female  19.0      0      0  30.0000        S  First
888         0       3  female   NaN      1      2  23.4500        S  Third
889         1       1    male  26.0      0      0  30.0000        C  First
890         0       3    male  32.0      0      0   7.7500        Q  Third

       who  adult_male deck  embark_town alive  alone    fare_2021
0      man        True  NaN  Southampton    no  False   849.482500
1    woman       False    C    Cherbourg   yes  False  8352.264261
2    woman       False  NaN  Southampton   yes   True   928.572250
3    woman       False    C  Southampton   yes  False  6221.727000
4      man        True  NaN  Southampton    no   True   943.218500
..     ...         ...  ...          ...   ...    ...          ...
885  woman       False  NaN   Queenstown    no  False  3412.576250
887  woman       False    B  Southampton   yes   True  3515.100000
888  woman       False  NaN  Southampton    no  False  2747.636500
889    man        True    C    Cherbourg   yes   True  3515.100000
890    man        True  NaN   Queenstown    no   True   908.067500

[784 rows x 16 columns]

### Cleaning Note:

While the columns are not the "prettiest", don't adjust any of them yet. We are going to update some values and add some values as we work through this notebook. Apologies for the extra visual "noise" on your screen. You will be given the option to tidy up the columns at the end of this notebook.

## Running Tables Note:  
If your tables don't appear to have accepted your changes, try the "Run All" option in the "Cell" section of the menu bar.

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# A. Aggregation

1. Work through the section Exercises.  
    - There are 4 sections in part A:
        - Groupby
        - Aggregation Methods
        - Groupby and Basic Math
        - Groupby and Multiple Aggregations

#### Creating Variables.

As we begin to manipulate our data, create new variables to store your work in.  This will keep your original data intact.  Having the original dataset available will save you time with each manipulation.  You can also create variable names that inform you of the purpose of the manipulation.

### 1: Groupby <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Groupby "embark_town"

1. Using the titanic data set, groupby "embark_town".
1. Create a variable that will represent the grouping of data.
1. Initialize it using the groupby() function and pass it the column.

In [7]:
# Code your groupby "embark_town" here:

data_grouped = data.groupby("embark_town")

In [8]:
# To view the grouped data as a table, use the variable_name.first():

data_grouped.first()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,alive,alone,fare_2021
embark_town,,,,,,,,,,,,,,,
Cherbourg,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,yes,False,8352.264261
Queenstown,0,3,male,2.0,0,0,8.4583,Q,Third,man,True,C,no,True,991.059011
Southampton,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,no,False,849.482500

#### Groupby "survived"

Did you know that you can also chain on some of our exploratory methods to the groupby method?

1. Create & initalize a new variable to hold a table that will groupby "survived" 
1. Use method chaining to tack on the describe method

In [9]:
# Code your groupby "survived" table here:

group_by_survived = data.groupby("survived")
# run your table below:

group_by_survived.first()

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021
survived,,,,,,,,,,,,,,,
0,3,male,22.0,1,0,7.2500,S,Third,man,True,E,Southampton,no,False,849.482500
1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,8352.264261

In [10]:
# run your table with describe

group_by_survived.describe()

         pclass                                                 age  \
          count      mean       std  min  25%  50%  75%  max  count
survived
0         549.0  2.531876  0.735805  1.0  2.0  3.0  3.0  3.0  424.0
1         342.0  1.950292  0.863321  1.0  1.0  2.0  3.0  3.0  290.0

                     ...  fare           fare_2021                            \
               mean  ...   75%       max     count         mean          std
survived             ...
0         30.626179  ...  26.0  263.0000     549.0  2591.552806  3677.756159
1         28.343690  ...  57.0  512.3292     342.0  5670.489909  7803.170270


          min          25%       50%      75%           max
survived
0         0.0   920.276614  1230.285  3046.42  30815.710000
1         0.0  1461.695750  3046.420  6678.69  60029.612364

[2 rows x 48 columns]

# How is this table organized?  Why are there 40 columns now?

It is organized into two rows that represent the two values for the original "survived" column - 0 and 1. 
There are 40 columns because the program is running the describe method on each column that has a numerical 
value because the statistical summary that the describe method completes has to be done on each of those
columns/categories of information.

### 2. Aggregation Methods <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Note: **agg()** and **aggregate()** are identical [source](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.aggregate.html)

#### Method Chaining

1. Create a variable to apply **agg()** to your grouped data.
1. Pass one of the following statistical values to **agg()**
   - "mean", "median", "mode", "min", "max", "std", "var", "first", "last", "sum"

In [11]:
# Code your method chain here:
    
data_grouped.agg()

TypeError: Must provide 'func' or tuples of '(column, aggfunc).

In [12]:
# Create a variable to apply agg("sum") to your grouped data

agg_sum = data_grouped.agg("sum")

# run your table:
agg_sum.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,alive,alone,fare_2021
embark_town,,,,,,,,,,,,,,,
Cherbourg,93,317,femalefemalefemalemalemalefemalemalemalefemale...,4005.92,65,61,10072.2962,CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC...,FirstSecondThirdThirdFirstFirstFirstThirdThird...,womanchildwomanmanmanwomanmanmanchildmanchildm...,90,CBDBADBFBACBBADDCBDBCECBECBEDBECDCCDBBDCBBCCAC...,yesyesyesnonoyesnoyesyesnoyesnoyesnonononoyesn...,85,1.180171e+06
Queenstown,30,224,malemalefemalefemalefemalefemalemalefemalefema...,786.50,33,13,1022.2543,QQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQ...,ThirdThirdThirdThirdThirdThirdThirdThirdThirdT...,manchildchildwomanwomanwomanmanwomanwomanwoman...,37,CECF,nonoyesyesyesyesnoyesyesyesnononoyesnoyesnonoy...,57,1.197775e+05
Southampton,217,1514,malefemalefemalemalemalemalefemalefemalefemale...,16312.75,368,266,17439.3988,SSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS...,ThirdThirdFirstThirdFirstThirdThirdThirdFirstT...,manwomanwomanmanmanchildwomanchildwomanmanmanc...,410,CEGCDACCCFFCEDCEDDCFCEBFAFGCCDGCBEBCCDACCCCDCC...,noyesyesnononoyesyesyesnononoyesyesnonoyesyesn...,393,2.043374e+06

In [ ]:
# Explain the sum table.  What is going on with the "sex", "class", and "alive" columns?

The program summed those string columns together, essentially concatenating them.

#### Using a Dictionary <span style="color:darkorange;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
##### A dictionary is a Python collection type.  

Is a collection type that stores **key-value pairs**.  A key-value pair is an organization system that is made up of a single *key* that has one or more *values* paired with it.  
Think of it like your contacts list.  The contacts list is the dictionary object.  
Each contact is organized by a key, usually name.  And attached to each name is contact information, or the values.
Some contacts might have email address, phone number, home or work address, etc. Other contacts may just be a name and phone number.  This is a very simple example, but understanding this organizational structure will be helpful as you learn to manipulate tables.  

*Here is a dictionary example with 3 keys:*
>**contacts_dictionary = {"name1": ["email", 555-5552, "work info"], 
      "name2": ["email", 555-5554],
      "name3": 555-5555}**
                     
*Here is a dictionary example with a single key-value pair*
**study_group_dictionary = {"john": ["john@email.com", 555-555-5555, "works at LaunchCode headquarters"]}**   

It has a single key, and a list of values. The organization of this structure is called a "Key-Value Pair".
Using the contact list example, the key would be the name of the person and the values would be their contact information.  The key is a single item (the person's name) and the values can be a single item (an email address) or mulitple items (email, phone number, address, work info, etc).
Keys and values can be any data type, but must use correct data type syntax.  The keys do not have to be strings, but they do need to be a single value.  

For more information, you can read more on dictionary objects [here](https://www.w3schools.com/python/python_dictionaries.asp).

#### Aggregation across multiple columns using dictionary functionality

##### Syntax Example:

**age_dictionary={"age":["sum", "max"]}**

We are creating a new dictionary (**age_dictionary**).  The key is **age** and the values we want are **"sum""** and **"max"**.  This dictionary object has now become a template for the aggregations we want to perform.  However, on it's own, it does nothing.  Once passed to the **agg()** method, it will pick out the specific location of data we want to examine, making a subset table.

The code is contained in the box below.  Run it and see what happens.


For syntax examples, review [this webpage](https://www.geeksforgeeks.org/python-pandas-dataframe-aggregate/).
#### <span style="color:coral;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

In [13]:
# Predict the table output before you uncomment the code below.

age_dictionary={"age":["sum", "max"]}
dictionary_agg=data.agg(age_dictionary)
dictionary_agg

          age
sum  21205.17
max     80.00

1. What if we want to look at more than one column at a time?  We pass more dictionaries to the agg function.
1. Create a variable to hold at least 3 columns.  Use the syntax from the "Syntax Example" as a guide.
    - Aggregate the following:  survived: "sum" & "count"; age: "std" & "min", and sibsp: "count" & "sum"

In [14]:
# Code your dictionary here:

other_dict = {
    "survived":["sum", "count"],
    "age":["std", "min"],
    "sibsp":["count", "sum"]
}

other_dict_agg = data.agg(other_dict)

other_dict_agg

       survived        age  sibsp
sum       342.0        NaN  466.0
count     891.0        NaN  891.0
std         NaN  14.526497    NaN
min         NaN   0.420000    NaN

### 3. Groupby and Basic Math <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Groupby "pclass".  Make sure you use a variable to hold your grouped data.

In [15]:
# <WARNING> For this section, you will need to filter out non-numeric data to run the aggregations
# The line below creates a new dataframe with only numeric columns to avoid warnings
num_only_data = data.select_dtypes(include='number')

# Code your groupby here using num_only_data:

group_by_pclass = num_only_data.groupby("pclass")

# Run your table using first() here instead of head():

group_by_pclass.first()

        survived   age  sibsp  parch     fare    fare_2021
pclass
1              1  38.0      1      0  71.2833  8352.264261
2              1  14.0      1      0  30.0708  3523.395636
3              0  22.0      1      0   7.2500   849.482500

### 4. Groupby and Multiple Aggregations <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Group with a List<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1. We want to do muliple aggregation functions to our newly grouped data set.  We created a variable to hold a list of functions we want to perform.  These functions are part of the agg method.  When we pass our list to the method, the method will iterate through each item and perform that function for the entire table.

In [16]:
# our list of functions
agg_func_list = ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']


#Apply the agg method to our passenger_class variable (made in the Groupby Basic Math section).  
# Pass our list to the function and run your table.

group_by_pclass.agg(agg_func_list)

       survived                                                                \
            sum      mean median min max       std       var first last count
pclass
1           136  0.629630    1.0   0   1  0.484026  0.234281     1    1   216
2            87  0.472826    0.0   0   1  0.500623  0.250624     1    0   184
3           119  0.242363    0.0   0   1  0.428949  0.183998     0    0   491

        ...     fare_2021                                               \
        ...           sum         mean       median  min           max
pclass  ...
1       ...  2.129847e+06  9860.404734  7063.886375  0.0  60029.612364
2       ...  4.454618e+05  2420.988000  1669.672500  0.0   8611.995000
3       ...  7.867608e+05  1602.364205   943.218500  0.0   8149.173500


                std           var        first       last count
pclass
1       9183.828263  8.434270e+07  8352.264261  3515.1000   216
2       1572.116612  2.471551e+06  3523.395636  1523.2100   184
3       1380.044864  1.904524e+06   849.482500   908.0675   491

[3 rows x 60 columns]

#### Group with a Dictionary<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Using only a list provides us with the entire table.  What if we only want to look at age vs pclass?  

we can create a dictionary to hold the age column for us.  The *key* would be the name of our column, and the values our list of functions to perform on that column.  The code would look like this:

In [17]:
agg_func_dict = {
    'age':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}
# We would run our table like this:
group_by_pclass.agg(agg_func_dict)

            age                                                             \
            sum       mean median   min   max        std         var first
pclass
1       7111.42  38.233441   37.0  0.92  80.0  14.802856  219.124543  38.0
2       5168.83  29.877630   29.0  0.67  70.0  14.001077  196.030152  14.0
3       8924.92  25.140620   24.0  0.42  74.0  12.495398  156.134976  22.0


        last count
pclass
1       26.0   186
2       27.0   173
3       32.0   355

Looking at the *age_func_dict* syntax, create a dictionary variable for the "survived" column and pass it to **passenger_class.agg()** in the box below.

In [18]:
# Code it here:


survived_dict = {
    'survived':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}

group_by_pclass.agg(survived_dict)

       survived
            sum      mean median min max       std       var first last count
pclass
1           136  0.629630    1.0   0   1  0.484026  0.234281     1    1   216
2            87  0.472826    0.0   0   1  0.500623  0.250624     1    0   184
3           119  0.242363    0.0   0   1  0.428949  0.183998     0    0   491

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# B. Recoding and Creating New Values and Variables 

1. Work through the Part B, there are 3 sections

### Create a New Column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

In the box below:
1. Create a new column by manipulating the values of an existing column.  Specifically, create a new column, "fare_2021" that allows us to compare the cost of fare in pounds back in 1912 to 2021.  The inflation multiplier from 1912 to 2021 is approximately 117.17.

In [19]:
# Code your new "fare_2021" column here:

data["fare_2021"] = data["fare"] * 117.17

# Run the head of your table to see your new column:

data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,849.482500
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,8352.264261
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,928.572250
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,6221.727000
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,943.218500

### Replacing Values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
 
Replace the string-based "yes","no" values in the "alive" column using booleans, replacing "yes" values with True and "no" values with False.

In [ ]:
# Code your updated values here:


data["alive"] = data["alive"].replace(to_replace={"yes": True, "no": False})

We can also use functions to update values.

1. Create a function that will convert the string-based "alive" values of "yes" or "no" to a boolean value of True or False. Apply it to your table and run your table here:

In [20]:
# Code your function here:

def alive_to_bool(data):
    alive = data['alive']
    if alive == "yes":
        return True
    else:
        return False
    
data['alive'] = data.apply(alive_to_bool, axis=1)

data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False,849.482500
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,True,False,8352.264261
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True,True,928.572250
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,True,False,6221.727000
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True,943.218500

### Using a function to create a new column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

Sometimes you might want to create a new column based on combining multiple columns together.

1. create an "age_group" column that breaks years up as 0-19, 20-29, 30-39, etc until all given ages are covered.  Make sure you check to see where you can stop counting by 10s.

In [21]:
# Write your max age check here:

data['age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [22]:
# Code the new "age_group" column function here:

def new_age_group(data):
    age = data["age"]
    if age <= 19:
        return "0-19"
    if age <= 29:
        return "20-29"
    if age <= 39:
        return "30-39"
    if age <= 49:
        return "40-49"
    if age <= 59:
        return "50-59"
    if age <= 69:
        return "60-69"
    if age <= 79:
        return "70-79"
    if age <= 89:
        return "80-89"
         

data["age_group"] = data.apply(new_age_group, axis=1)

data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021,age_group
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False,849.482500,20-29
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,True,False,8352.264261,30-39
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True,True,928.572250,20-29
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,True,False,6221.727000,30-39
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True,943.218500,30-39

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# C. Reshaping Tables

1. Work through Part C, there are 4 sections

### Sort_values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Use **sort_values()** to answer the following question:
> What is the age of the person who paid the highest fare?

Hint: We want to see the highest fare value first. To find this, should we set the sort order to ascending or descending?  Check the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values) for the syntax.

In [ ]:
# Code your sort_values here:
data.sort_values(by="fare", ascending=False)

# Run your table here:
data.sort_values(by="fare", ascending=False).head()

# The ages of the people who paid the highest fare are 36 and 35. Three people paid the same highest fare. One person
# was 36, and the other two were 35.

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021,age_group
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,True,False,60029.612364,30-39
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,True,True,60029.612364,30-39
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,True,True,60029.612364,30-39
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,True,False,30815.710000,20-29
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,False,False,30815.710000,60-69

### pivot_table <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
1. pivot the table of the summed data where the values are "fare", index is "who" and "age_group", and the columns are "survived"

Hint: set the aggfunc parameter to np.sum

In [26]:
# Code your pivot_table here:

sum_pivot_table = data.pivot_table(
    values="fare",
    index=["who", "age_group"],
    columns="survived",
    aggfunc=np.sum
)
# Run your table here:
print(sum_pivot_table)

survived                 0          1
who   age_group
child 0-19       1109.5459  1611.6751
man   0-19        978.4249   145.5333
      20-29      2435.2329   646.9542
      30-39      1506.2789  1720.9459
      40-49      1110.6374   466.6793
      50-59       853.3042   226.2000
      60-69       586.4875    89.7000
      70-79       181.1834        NaN
      80-89            NaN    30.0000
woman 0-19        126.1375  1243.0209
      20-29       404.7500  2514.4291
      30-39       164.9042  3350.8791
      40-49       241.2542  1563.6335
      50-59        39.2125  1182.0833
      60-69            NaN   242.7958

C:\Users\Sa Shea\AppData\Local\Temp\ipykernel_25940\4018208569.py:3: FutureWarning: The provided callable <function sum at 0x00000195A838DC60> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  sum_pivot_table = data.pivot_table(

### Wide to Long <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Create a table where the columns are "who" and the values are "pclass"
1. Answer the question:  How does this table differ from the pivot_table above?  Specifically, how is "who" different?

In [ ]:
# Code your table here:

new_pivot_table = data.pivot_table(values= "pclass", columns="who")
# Run your table here:

print(new_pivot_table)

# Answer the question here:

# It seems like it might take the average of the pclass for each option for "who" in this table while the previous
# table sections the data into rows by "who" options then splits each "who" by age group and provides the sum of
# the fare for each age group based on whether they survived or not.

who        child       man     woman
pclass  2.626506  2.372439  2.084871

### Melt <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1.  What does the **melt** function do to the data?

# What does melt do?
Melt takes an existing dataframe and creates two columns from the data within it. It is used to reshape tables from wide format to long format.

2.  With a new variable, apply a default melt to your data.

In [30]:
# Create your default melt table here with the following syntax:  new_name = pd.melt(data_set)

new_melted_data = pd.melt(data)

# Run your table here:
print(new_melted_data)

# Check the shape of your new table.

new_melted_data.shape

        variable  value
0       survived      0
1       survived      1
2       survived      1
3       survived      1
4       survived      0
...          ...    ...
15142  age_group  20-29
15143  age_group   0-19
15144  age_group   None
15145  age_group  20-29
15146  age_group  30-39

[15147 rows x 2 columns]

(15147, 2)

3. Create a melt table where the index variables are "embarked", and the values are "fare" and "deck"

In [33]:
# Create your melt table here:

other_melted_data = pd.melt(data, value_vars=["fare", "deck"], var_name="embarked")

# Run your table here:

print(other_melted_data)

# Check the shape

other_melted_data.shape

     embarked    value
0        fare     7.25
1        fare  71.2833
2        fare    7.925
3        fare     53.1
4        fare     8.05
...       ...      ...
1777     deck      NaN
1778     deck        B
1779     deck      NaN
1780     deck        C
1781     deck      NaN

[1782 rows x 2 columns]

(1782, 2)

# Optonal Challenges:

1. Clean and Explore the table.  
    1. How would you handle any missing data?
    1. Would you keep all of the columns?
    1. Would you want to manipulate any data?